<a href="https://colab.research.google.com/github/KaioViana/Titanic-predict/blob/master/titanic.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

#**Desafio Kaggle Titanic**
---
Desafio do titanic abrange de maneira clara quais técnicas de DataScience aplicar para prever a taxa de sobrevivência no acidente.
#####É o problema clássico, prever o resultado de um evento binário. Em termos leigos, isso significa que ocorreu ou não. Um aplicativo de negócios comum é a rotatividade ou retenção de clientes. Outro caso de uso popular é a taxa de mortalidade ou análise de sobrevivência da assistência médica.
#####No escopo desse desafio não está os processos comuns em um processo de ciência de dados, como arquitetura, governança e extração de dados. Apenas a limpeza está no escopo.

#**"DataScience Framework"**
---
>1 - Defina o problema:
>>* Se ciência de dados, big data, aprendizado de máquina, análise preditiva, inteligência de negócios ou qualquer outra palavra da moda é a solução, então qual é o problema ? Como diz o ditado, não coloque a carroça na frente do cavalo. **Problemas** antes dos **requisitos**, **requisitos** antes das **soluções**, **solução** antes do **design** e **desing** antes da **tecnologia**.
>
>2 - Reúna os dados:
>>* Jhon Naisbitt escreveu em seu livro Megatrends de 1984: "estamos nos afogando em dados, mas buscando conhecimento." Então, é provável que os conjuntos de dados já existam em algum lugar, em algum formato. Pode ser externo ou interno, estruturado ou não, estático ou transmitido, objetivo ou subjetivo, etc. Você não precisa reinventar a roda, apenas precisa saber onde encontrá-la. nos preocuparemos em transform dados sujos em dados limpos.
>
>3 - Preparar os dados para consumo:
>>* Essa etapa é geralmente chamada de organização de dados, um processo necessário para transformar dados "selvagens" em dados "gerenciáveis". A organização de dados inclui a implementação de arquiteturas de dados para o armazenamento e processamento, desenvolvimento de padrões de governança de dados para qualidade e controle, extração de dados (ou seja, ETL e raspagem da Web) e para identificar pontos de dados aberrantes, ausentes ou fora de linha.
>
>4 - Realizar análise exploratória:
>> * Qualquer pessoa que já trabalhou com dados sabe, GIGO(Garbage, In, Out). Portanto, é importante implantar estatísticas descritivas e gráficas para procurar possíveis problemas, padrões, classificações, correlações, correlações no conjunto de dados. Além disso, a categorização de dados (ou seja, qualitativa versus quantitativa) também é importante para entender e selecionar o teste de hipótese ou o modelo de dados corretos.
>
>5 - Modelo:
>> * Como as estatísticas descritivas e inferenciais, a modelagem de dados pode resumir os dados ou prever resultados futuros. O conjunto de dados e os resultados esperados determinarão os algortimos disponíveis para uso. É importante lembrar que algoritmos são ferramentas e não varinhas mágicas ou balas de prata. Você ainda deve ser o mestre de artesanato que sabe como selecionar a ferramenta certa para o trabalho. Uma analogia seria pedir que alguém lhe entregasse uma chave de fenda Philip, e eles entregassem um chave de de fenda de ponta chata ou, pior ainda, um martelo. Na melhor das hipóteses, mostra uma completa falta de entendimento. Na pior, impossibilita a conclusão do projeto. O mesmo acontece na modelagem de dados. O modelo errado pode levar a um desenpenho ruim na melhor das hipóteses e a uma conclusão errada (que é usada como inteligência acionável) na pior das hipóteses, e pior ainda, **perca de quem sabe, milhares de reais para uma empresa**.
>
>6 - Validar e implementar o modelo de dados:
>> * Depois de treinar seu modelo de dados com base em um subconjunto de dados, é hora de testá-lo. Isso ajuda a garantir que você não tenha ajustado demais o modelo ou o tenha tornado tão específico para o subconjunto selecionado, que ele não se ajusta com precisão a outro conjunto de dados. Nesta etapa, determinamos se o nosse  modelo sperajustou, generalizou ou subestimou nosso conjunto de dados.
>
>7 - Otimize e crie estratégias: 
>>Este é o passo do "homem biônico", no qual você repete o processo para torná-lo melhor ...mais forte... mais rápido do que era antes. Como cientista de dados, sua estratégia deve tercerizar as operações do desenvolvedor e o encadeamento de aplicativos, para que você tenha mais tempo para se concentrar nas recomendações e no desing. Quando você conseguir empacotar suas idéias, isso se tornará sua taxa de "câmbio de moeda."
>

#**Initial imports**
---

In [0]:
import sys
import pandas as pd
import matplotlib
import numpy as np
import scipy as sp
import IPython
from IPython import display
import sklearn
import random
import time

import warnings
warnings.filterwarnings('ignore')

from subprocess import check_output

pd.set_option('display.max_rows', None)

#**Load Data Modelling Libraries**
---

In [0]:
# Modelos comuns de algorítmos
from sklearn import svm, tree, linear_model, neighbors, naive_bayes, ensemble, discriminant_analysis, gaussian_process
from xgboost import XGBClassifier

# Modelos comuns para manipulação dos dados
from sklearn.preprocessing import OneHotEncoder, LabelEncoder
from sklearn import feature_selection
from sklearn import metrics

# Visualizações
import matplotlib as mpl
import matplotlib.pyplot as plt
import matplotlib.pylab as pylab
import seaborn as sns
from pandas.plotting import scatter_matrix

# Configurar parâmetros de visualização dos dados
%matplotlib inline
mpl.style.use('ggplot')
sns.set_style('white')
pylab.rcParams['figure.figsize'] = 12,8

#**Conhecendo os dados**
---
Nesta etapa é o momento em que vamos realmente conhecer nossos dados. Ver seus tipo e valores e etc. Uma análise inicial.
>1. A coluna Survived é a nossa variável dependente. É uma tipo de dados nominal binário de 1 para sobreviveu e 0 para morto. Todas as outras colunas são preditores ou variáveis independentes. É importante notar que mais variáveis preditores não formam um modelo melhor, mas as variáveis corretas.
>
>2. As variáveis PassengerID e Ticket são consideradas identificadores únicos aleatórios, que não têm impacto na variável de resultado. Assim, eles serão excluídos da análise.
>
>3. A variável Pclass é um tipo de dados ordinal para a classe de ticket, um proxy para o status socioeconômico, representando :
>>1 = classe alta;
>>
>>2 = classe média;
>>
>> 3 = classe baixa;
>>
>
>4. A variável Name é um tipo de dados nominal. Pode ser usado na engenharia de recursos para derivar o gênero do título, o tamanho da família através do sobrenome e o status de títulos como Dr. e etc. Faremos o uso delas para ver se faz diferença ser Dr. ou não.
>
>5. As variáveis Sex e Embarked são um tipo de dados nominal. Eles serão convertidos em variáveis dummy para cálculos matemáticos.
>
>6. A variável Age e Fare são tipos de dados quantitativos contínuos.
>
>7. O SibSp representa o número de irmãos/cônjugues relacionados a bordo e Parch representa o número de paos/filhos relacionados a bordo. Ambos são do tipo de dados quantitativos discretos. Isso pode ser usado para a engenharia de recursos para criar uma variável tamanho da família do tipo quantitativa discreta.
>
>8. A variável Cabin é um tipo de dados nominal que pode ser usado na engenharia de recursos para posição aproximada no navio qundo o incidente ocorre e o status social /econômico nos níveis do convés. No entanto, como existem muitos valores nulos, ele não agrega valor e, portato, é excluído da análise.

In [4]:
# importando os arquivos
from google.colab import files
up = files.upload()

Saving test.csv to test.csv
Saving train.csv to train.csv

In [16]:
# lendo os arquivos
data_raw = pd.read_csv('train.csv')
data_val = pd.read_csv('test.csv')

# criando cópia dos dados de treino para podermos brincarmos com ele hehe
data1 = data_raw.copy(deep=True)
data_cleaner = [data1, data_val] # fazendo atribuições para podermos executar limpezas e etc

# pré-visualizando
data_raw.info()
print('\n\n')
data_raw.sample(15)

# Tipo das variáveis:
#     Name: categórica nominal
#     Sex: categórica nominal
#     Pclass: categórica ordinal
#     Age: numérica discreta
#     SibSp: numérica discreta
#     Parch: numérica discreta
#     Ticket: numérica discreta
#     Fare: numérica contínua
#     Cabin: @
#     Embarked: categórica nominal

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
PassengerId    891 non-null int64
Survived       891 non-null int64
Pclass         891 non-null int64
Name           891 non-null object
Sex            891 non-null object
Age            714 non-null float64
SibSp          891 non-null int64
Parch          891 non-null int64
Ticket         891 non-null object
Fare           891 non-null float64
Cabin          204 non-null object
Embarked       889 non-null object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.7+ KB

     PassengerId  Survived  Pclass  ...      Fare    Cabin  Embarked
471          472         0       3  ...    8.6625      NaN         S
437          438         1       2  ...   18.7500      NaN         S
728          729         0       2  ...   26.0000      NaN         S
375          376         1       1  ...   82.1708      NaN         C
723          724         0       2  ...   13.0000      NaN         S
128          129         1       3  ...   22.3583    F E69         C
708          709         1       1  ...  151.5500      NaN         S
724          725         1       1  ...   53.1000       E8         S
309          310         1       1  ...   56.9292      E36         C
267          268         1       3  ...    7.7750      NaN         S
887          888         1       1  ...   30.0000      B42         S
352          353         0       3  ...    7.2292      NaN         C
297          298         0       1  ...  151.5500  C22 C26         S
871          872         1       1  ...   52.5542      D35         S
661          662         0       3  ...    7.2250      NaN         C

[15 rows x 12 columns]

#**Os 4 C's da limpeza de dados:**
---
Corrigindo, completando, criando e convertendo.
######Nesta etapa, limparemos nossos dados:
>1 - corrigindo valores e valores discrepantes
>>*  Revendo os dados, não parece haver nenhuma entrada de dados aberrante ou não aceitável. Além disso, vemos que podemos ter discrepâncias potenciais em termo de idade e tarifa. No entanto, como são valores razoáveis, esperaremos até concluir nossa análise exploratória para determinar se devemos incluir ou excluir do conjunto de dados. Deve-se observar que, se fossem valores ilógicos, por exemplo, idade = 800 em vez de 80, provavelmente será uma decisão segura de corrigir agora. No entanto queremos ter cuidado ao modificar os dados.
>
>2 - preenchendo informações ausentes;
>>* Existem valores nulos ou dados ausentes nos campos Age, Cabin e Embarked. Valores ausentes podem ser ruins, porque alguns algoritmos não sabem como lidar com valores nulos e falharão. Enquanto outros, como árvores de decisão, podem lidar com valores nulos. Portanto, é importante corrigir antes de começarmos a modelar, porque compararemos e contrastaremos vários modelos. Existem dois métodos comuns, excluir ou prencher com um valor razoável (média/moda/desvio padrão/mediana).
>
>3 - criando novos recursos para análise ;
>>* A engenharia de recursos é quando usamos os recursos existentes para criar novos recursos para determinar se eles fornecem novos sinais para prever nosso resultado. Para este conjunto de dados, criaremos um recurso de título para determinar se ele desempenhou algum papel na sobrevivência.
>
>4 - convertendo campos para o forato correto para cálculos e apresentação;
>>* Por último, mas não menos importante, trataremos da formatação. Não há formatos de data ou moeda, mas formatos de tipo de dados. Nossos dados categóricos são importados como objetos, o que dificulta os cálculos matemáticos. Para esse conjunto de dados, converteremos tipos de dados de objeto em variáveis dummy categóticas.
>

In [17]:
print('Colunas do data1 com valores null:\n', data1.isnull().sum())
print('-'*10)
print('Colunas do data_val com valores null:\n', data_val.isnull().sum())
print('-'*10)
data1.describe(include='all')


# Oque limpar dos dados ?
# data1:
#   Contém valores faltantes nas colunas Age, Cabin e Embarked
# data_val:
#   Contém valores faltantes nas colunas Age, Cabin e Fare

Colunas do data1 com valores null:
 PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age            177
SibSp            0
Parch            0
Ticket           0
Fare             0
Cabin          687
Embarked         2
dtype: int64
----------
Colunas do data_val com valores null:
 PassengerId      0
Pclass           0
Name             0
Sex              0
Age             86
SibSp            0
Parch            0
Ticket           0
Fare             1
Cabin          327
Embarked         0
dtype: int64
----------

        PassengerId    Survived      Pclass  ...        Fare    Cabin  Embarked
count    891.000000  891.000000  891.000000  ...  891.000000      204       889
unique          NaN         NaN         NaN  ...         NaN      147         3
top             NaN         NaN         NaN  ...         NaN  B96 B98         S
freq            NaN         NaN         NaN  ...         NaN        4       644
mean     446.000000    0.383838    2.308642  ...   32.204208      NaN       NaN
std      257.353842    0.486592    0.836071  ...   49.693429      NaN       NaN
min        1.000000    0.000000    1.000000  ...    0.000000      NaN       NaN
25%      223.500000    0.000000    2.000000  ...    7.910400      NaN       NaN
50%      446.000000    0.000000    3.000000  ...   14.454200      NaN       NaN
75%      668.500000    1.000000    3.000000  ...   31.000000      NaN       NaN
max      891.000000    1.000000    3.000000  ...  512.329200      NaN       NaN

[11 rows x 12 columns]

#**Limpando/Completando os dados**

In [18]:
# COMPLETANDO: completar ou deletar valores faltantes nos dados de treino/test
for dataset in data_cleaner:
  # completar idades faltantes com a mediana
  dataset['Age'].fillna(dataset['Age'].median(), inplace=True)
  # completar enbarked com a moda
  dataset['Embarked'].fillna(dataset['Embarked'].mode()[0], inplace=True)
  # completar Tarifa faltantes com a mediana
  dataset['Fare'].fillna(dataset['Fare'].median(), inplace=True)

# deletando coluna Cabin e outras que não será necessária para nossa análise
drop_column = ['PassengerId', 'Cabin', 'Ticket']
data1.drop(drop_column, axis=1, inplace=True)

print(data1.isnull().sum())
print('-'*10)
print(data_val.isnull().sum())

Survived    0
Pclass      0
Name        0
Sex         0
Age         0
SibSp       0
Parch       0
Fare        0
Embarked    0
dtype: int64
----------
PassengerId      0
Pclass           0
Name             0
Sex              0
Age              0
SibSp            0
Parch            0
Ticket           0
Fare             0
Cabin          327
Embarked         0
dtype: int64

In [0]:
# CRIANDO: criando novos recursos para os dados de treino e test (Engenharia de recursos)
for dataset in data_cleaner:
  # variáveis discretas  
  dataset['FamilySize'] = dataset['SibSp'] + dataset['Parch'] + 1 # soma a quantidade de parentes e cônjugues mais o passageiro
  # criando a variávels IsAlone para verificar se a pessoa estava só a bordo do návio ou não e inicializando com 1
  dataset['IsAlone'] = 1
  dataset['IsAlone'].loc[dataset['FamilySize'] > 1] = 0 # definindo 0 para as pessoas que não estão sozinhas a bordo
  # criando a variável Title que irá informar o status social do passageiro.
  dataset['Title'] = dataset['Name'].str.split(',', expand=True)[1].str.split('.',expand=True)[0]

  # variáveis contínuas
  dataset['FareBin'] = pd.qcut(dataset['Fare'], 4) # dividindo o Fare em faixas
  dataset['AgeBin'] = pd.cut(dataset['Age'].astype(int), 5) # o mesmo para Age


# limpando os Titles com poucas ocorrências
stat_min = 10 # um estado mínimo, o número 10 é considerado um bom número na estatística
title_names = (data1['Title'].value_counts() < stat_min)

# aplicando as duas linhas de código acima
data1['Title'] = data1['Title'].apply(lambda x: 'Misc' if title_names.loc[x] == True else x)

In [25]:
print(data1['Title'].value_counts()) # como pode se ver essa alteração pegou os titles com poucas ocorrências e colocou em um Title só
print('='*33)
# amostra de como os dados estão ficando
data1.info()
data_val.info()
data1.sample(21)

 Mr        517
 Miss      182
 Mrs       125
 Master     40
Misc        27
Name: Title, dtype: int64
=================================
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 14 columns):
Survived      891 non-null int64
Pclass        891 non-null int64
Name          891 non-null object
Sex           891 non-null object
Age           891 non-null float64
SibSp         891 non-null int64
Parch         891 non-null int64
Fare          891 non-null float64
Embarked      891 non-null object
FamilySize    891 non-null int64
IsAlone       891 non-null int64
Title         891 non-null object
FareBin       891 non-null category
AgeBin        891 non-null category
dtypes: category(2), float64(2), int64(6), object(4)
memory usage: 85.8+ KB
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 418 entries, 0 to 417
Data columns (total 16 columns):
PassengerId    418 non-null int64
Pclass         418 non-null int64
Name           418 non-null object
Sex            418 non-null object
Age            418 non-null float64
SibSp          418 non-null int64
Parch          418 non-null int64
Ticket         418 non-null object
Fare           418 non-null float64
Cabin          91 non-null object
Embarked       418 non-null object
FamilySize     418 non-null int64
IsAlone        418 non-null int64
Title          418 non-null object
FareBin        418 non-null category
AgeBin         418 non-null category
dtypes: category(2), float64(2), int64(6), object(6)
memory usage: 47.1+ KB

     Survived  Pclass  ...          FareBin         AgeBin
495         0       3  ...   (14.454, 31.0]   (16.0, 32.0]
170         0       1  ...  (31.0, 512.329]   (48.0, 64.0]
207         1       3  ...   (14.454, 31.0]   (16.0, 32.0]
499         0       3  ...   (-0.001, 7.91]   (16.0, 32.0]
35          0       1  ...  (31.0, 512.329]   (32.0, 48.0]
622         1       3  ...   (14.454, 31.0]   (16.0, 32.0]
745         0       1  ...  (31.0, 512.329]   (64.0, 80.0]
115         0       3  ...   (7.91, 14.454]   (16.0, 32.0]
639         0       3  ...   (14.454, 31.0]   (16.0, 32.0]
233         1       3  ...  (31.0, 512.329]  (-0.08, 16.0]
72          0       2  ...  (31.0, 512.329]   (16.0, 32.0]
626         0       2  ...   (7.91, 14.454]   (48.0, 64.0]
128         1       3  ...   (14.454, 31.0]   (16.0, 32.0]
713         0       3  ...   (7.91, 14.454]   (16.0, 32.0]
379         0       3  ...   (-0.001, 7.91]   (16.0, 32.0]
0           0       3  ...   (-0.001, 7.91]   (16.0, 32.0]
664         1       3  ...   (7.91, 14.454]   (16.0, 32.0]
31          1       1  ...  (31.0, 512.329]   (16.0, 32.0]
740         1       1  ...   (14.454, 31.0]   (16.0, 32.0]
543         1       2  ...   (14.454, 31.0]   (16.0, 32.0]
389         1       2  ...   (7.91, 14.454]   (16.0, 32.0]

[21 rows x 14 columns]

#**Convertendo os formatos**
---
Converteremos dados categóricos em variáveis simuladas para análise matemática. Existem várias maneiras de codificar variáveis categóricas; usaremos as funções do sklearn e pandas

In [0]:
# CONVERTENDO

# code categorical data
label = LabelEncoder()
for dataset in data_cleaner:
  dataset['Sex_Code'] = label.fit_transform(dataset['Sex'])
  dataset['Embarked_Code'] = label.fit_transform(dataset['Embarked'])
  dataset['Title_Code'] = label.fit_transform(dataset['Title'])
  dataset['AgeBin_Code'] = label.fit_transform(dataset['AgeBin'])
  dataset['FareBin_Code'] = label.fit_transform(dataset['FareBin'])


# definindo a variável de saída
Target = ['Survived']

# definindo variáveis para criação das features/visualizações
data1_x = ['Sex', 'Pclass', 'Embarked', 'Title', 'SibSp', 'Parch', 'Age', 'Fare', 'FamilySize', 'IsAlone']
data1_x_calc = ['Sex_Code', 'Pclass', 'Embarked_Code', 'Title_Code', 'SibSp', 'Parch', 'Age', 'Fare']
data1_xy = Target + data1_x_calc

# sem as variáveis contínuas
data1_x_bin = ['Sex_Code', 'Pclass', 'Embarked_Code', 'Title_Code', 'FamilySize', 'AgeBin_Code', 'FareBin_Code']
data1_xy_bin = Target + data1_x_bin

# definindo features para tipos dummy
data1_dummy = pd.get_dummies(data1[data1_x])
data1_x_dummy = data1_dummy.columns.tolist()
data1_xy_dummy = Target + data1_x_dummy

In [51]:
# mostrando o resultado da linhas acima ;)
print(f'data1_x:\n{data1_x}\n================================================================================================================\ndata1_x_calc:\n{data1_x_calc}\n================================================================================================================\ndata1_xy:\n{data1_xy}\n================================================================================================================\ndata1_x_bin:\n{data1_x_bin}\n================================================================================================================\ndata1_xy_bin:\n{data1_xy_bin}\n================================================================================================================\ndata1_dummy:\n{data1_dummy.sample(6)}\n============================================================================================================================================================================================================================================================\ndata1_x_dummy:\n{data1_x_dummy}\n============================================================================================================================================================================================================================================================\ndata1_xy_dummy:\n{data1_xy_dummy}\n================================================================================================================================================================================================================================\n')

# Como o data1 está agora ;)
data1.sample(21)

data1_x:
['Sex', 'Pclass', 'Embarked', 'Title', 'SibSp', 'Parch', 'Age', 'Fare', 'FamilySize', 'IsAlone']
================================================================================================================
data1_x_calc:
['Sex_Code', 'Pclass', 'Embarked_Code', 'Title_Code', 'SibSp', 'Parch', 'Age', 'Fare']
================================================================================================================
data1_xy:
['Survived', 'Sex_Code', 'Pclass', 'Embarked_Code', 'Title_Code', 'SibSp', 'Parch', 'Age', 'Fare']
================================================================================================================
data1_x_bin:
['Sex_Code', 'Pclass', 'Embarked_Code', 'Title_Code', 'FamilySize', 'AgeBin_Code', 'FareBin_Code']
================================================================================================================
data1_xy_bin:
['Survived', 'Sex_Code', 'Pclass', 'Embarked_Code', 'Title_Code', 'FamilySize', 'AgeBin_Code', 'FareBin_Code']
================================================================================================================
data1_dummy:
     Pclass  SibSp  Parch   Age  ...  Title_ Miss  Title_ Mr  Title_ Mrs  Title_Misc
412       1      1      0  33.0  ...            1          0           0           0
258       1      0      0  35.0  ...            1          0           0           0
795       2      0      0  39.0  ...            0          1           0           0
150       2      0      0  51.0  ...            0          0           0           1
33        2      0      0  66.0  ...            0          1           0           0
73        3      1      0  26.0  ...            0          1           0           0

[6 rows x 17 columns]
============================================================================================================================================================================================================================================================
data1_x_dummy:
['Pclass', 'SibSp', 'Parch', 'Age', 'Fare', 'FamilySize', 'IsAlone', 'Sex_female', 'Sex_male', 'Embarked_C', 'Embarked_Q', 'Embarked_S', 'Title_ Master', 'Title_ Miss', 'Title_ Mr', 'Title_ Mrs', 'Title_Misc']
============================================================================================================================================================================================================================================================
data1_xy_dummy:
['Survived', 'Pclass', 'SibSp', 'Parch', 'Age', 'Fare', 'FamilySize', 'IsAlone', 'Sex_female', 'Sex_male', 'Embarked_C', 'Embarked_Q', 'Embarked_S', 'Title_ Master', 'Title_ Miss', 'Title_ Mr', 'Title_ Mrs', 'Title_Misc']
================================================================================================================================================================================================================================

     Survived  Pclass  ... AgeBin_Code FareBin_Code
155         0       1  ...           3            3
55          1       1  ...           1            3
70          0       2  ...           1            1
317         0       2  ...           3            1
564         0       3  ...           1            1
776         0       3  ...           1            0
757         0       2  ...           1            1
529         0       2  ...           1            1
225         0       3  ...           1            1
537         1       1  ...           1            3
705         0       2  ...           2            2
442         0       3  ...           1            0
118         0       1  ...           1            3
792         0       3  ...           1            3
343         0       2  ...           1            1
797         1       3  ...           1            1
147         0       3  ...           0            3
807         0       3  ...           1            0
651         1       2  ...           1            2
103         0       3  ...           2            1
517         0       3  ...           1            2

[21 rows x 19 columns]

In [52]:
# Como está data1_dummy repare em como é a transformação dummy
print('\n\nDUMIES')
data1_dummy.sample(21)

DUMIES

     Pclass  SibSp  Parch   Age  ...  Title_ Miss  Title_ Mr  Title_ Mrs  Title_Misc
663       3      0      0  36.0  ...            0          1           0           0
819       3      3      2  10.0  ...            0          0           0           0
326       3      0      0  61.0  ...            0          1           0           0
526       2      0      0  50.0  ...            1          0           0           0
447       1      0      0  34.0  ...            0          1           0           0
95        3      0      0  28.0  ...            0          1           0           0
139       1      0      0  24.0  ...            0          1           0           0
224       1      1      0  38.0  ...            0          1           0           0
11        1      0      0  58.0  ...            1          0           0           0
671       1      1      0  31.0  ...            0          1           0           0
861       2      1      0  21.0  ...            0          1           0           0
21        2      0      0  34.0  ...            0          1           0           0
46        3      1      0  28.0  ...            0          1           0           0
391       3      0      0  21.0  ...            0          1           0           0
646       3      0      0  19.0  ...            0          1           0           0
94        3      0      0  59.0  ...            0          1           0           0
9         2      1      0  14.0  ...            0          0           1           0
595       3      1      1  36.0  ...            0          1           0           0
698       1      1      1  49.0  ...            0          1           0           0
54        1      0      1  65.0  ...            0          1           0           0
171       3      4      1   4.0  ...            0          0           0           0

[21 rows x 17 columns]

In [47]:
# Checando mais uma vez

# dataset Treino com as colunas vazias
print(data1.isnull().sum())
print('-'*10)
print(data1.info())
print('-'*10)

# dataset Teste/Validação com as colunas vazias
print(data_val.isnull().sum())
print('-'*10)
print(data_val.info())
print('-'*10)

data_raw.describe(include='all')

Survived         0
Pclass           0
Name             0
Sex              0
Age              0
SibSp            0
Parch            0
Fare             0
Embarked         0
FamilySize       0
IsAlone          0
Title            0
FareBin          0
AgeBin           0
Sex_Code         0
Embarked_Code    0
Title_Code       0
AgeBin_Code      0
FareBin_Code     0
dtype: int64
----------
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 19 columns):
Survived         891 non-null int64
Pclass           891 non-null int64
Name             891 non-null object
Sex              891 non-null object
Age              891 non-null float64
SibSp            891 non-null int64
Parch            891 non-null int64
Fare             891 non-null float64
Embarked         891 non-null object
FamilySize       891 non-null int64
IsAlone          891 non-null int64
Title            891 non-null object
FareBin          891 non-null category
AgeBin           891 non-null category
Sex_Code         891 non-null int64
Embarked_Code    891 non-null int64
Title_Code       891 non-null int64
AgeBin_Code      891 non-null int64
FareBin_Code     891 non-null int64
dtypes: category(2), float64(2), int64(11), object(4)
memory usage: 120.7+ KB
None
----------
PassengerId        0
Pclass             0
Name               0
Sex                0
Age                0
SibSp              0
Parch              0
Ticket             0
Fare               0
Cabin            327
Embarked           0
FamilySize         0
IsAlone            0
Title              0
FareBin            0
AgeBin             0
Sex_Code           0
Embarked_Code      0
Title_Code         0
AgeBin_Code        0
FareBin_Code       0
dtype: int64
----------
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 418 entries, 0 to 417
Data columns (total 21 columns):
PassengerId      418 non-null int64
Pclass           418 non-null int64
Name             418 non-null object
Sex              418 non-null object
Age              418 non-null float64
SibSp            418 non-null int64
Parch            418 non-null int64
Ticket           418 non-null object
Fare             418 non-null float64
Cabin            91 non-null object
Embarked         418 non-null object
FamilySize       418 non-null int64
IsAlone          418 non-null int64
Title            418 non-null object
FareBin          418 non-null category
AgeBin           418 non-null category
Sex_Code         418 non-null int64
Embarked_Code    418 non-null int64
Title_Code       418 non-null int64
AgeBin_Code      418 non-null int64
FareBin_Code     418 non-null int64
dtypes: category(2), float64(2), int64(11), object(6)
memory usage: 63.4+ KB
None
----------

        PassengerId    Survived      Pclass  ...        Fare    Cabin  Embarked
count    891.000000  891.000000  891.000000  ...  891.000000      204       889
unique          NaN         NaN         NaN  ...         NaN      147         3
top             NaN         NaN         NaN  ...         NaN  B96 B98         S
freq            NaN         NaN         NaN  ...         NaN        4       644
mean     446.000000    0.383838    2.308642  ...   32.204208      NaN       NaN
std      257.353842    0.486592    0.836071  ...   49.693429      NaN       NaN
min        1.000000    0.000000    1.000000  ...    0.000000      NaN       NaN
25%      223.500000    0.000000    2.000000  ...    7.910400      NaN       NaN
50%      446.000000    0.000000    3.000000  ...   14.454200      NaN       NaN
75%      668.500000    1.000000    3.000000  ...   31.000000      NaN       NaN
max      891.000000    1.000000    3.000000  ...  512.329200      NaN       NaN

[11 rows x 12 columns]